{"class_name": "Model", "config": {"output_layers": [["dense_1", 0, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 299, 299, 3], "dtype": "float32", "name": "input_1", "sparse": false}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"use_bias": false, "bias_regularizer": null, "name": "block1_conv1", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "filters": 32, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "padding": "valid", "strides": [2, 2], "trainable": true, "dilation_rate": [1, 1], "kernel_size": [3, 3], "activation": "linear"}, "name": "block1_conv1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "block1_conv1_bn", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "scale": true, "axis": -1, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 0.001}, "name": "block1_conv1_bn", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "block1_conv1_act", "activation": "relu"}, "name": "block1_conv1_act", "inbound_nodes": [[["block1_conv1_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": false, "bias_regularizer": null, "name": "block1_conv2", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "filters": 64, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "padding": "valid", "strides": [1, 1], "trainable": true, "dilation_rate": [1, 1], "kernel_size": [3, 3], "activation": "linear"}, "name": "block1_conv2", "inbound_nodes": [[["block1_conv1_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "block1_conv2_bn", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "scale": true, "axis": -1, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 0.001}, "name": "block1_conv2_bn", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "block1_conv2_act", "activation": "relu"}, "name": "block1_conv2_act", "inbound_nodes": [[["block1_conv2_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"use_bias": false, "bias_regularizer": null, "name": "block2_sepconv1", "depth_multiplier": 1, "data_format": "channels_last", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "filters": 128, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "depthwise_constraint": null, "pointwise_regularizer": null, "depthwise_regularizer": null, "activation": "linear", "pointwise_constraint": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "block2_sepconv1", "inbound_nodes": [[["block1_conv2_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "block2_sepconv1_bn", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "scale": true, "axis": -1, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 0.001}, "name": "block2_sepconv1_bn", "inbound_nodes": [[["block2_sepconv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "block2_sepconv2_act", "activation": "relu"}, "name": "block2_sepconv2_act", "inbound_nodes": [[["block2_sepconv1_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"use_bias": false, "bias_regularizer": null, "name": "block2_sepconv2", "depth_multiplier": 1, "data_format": "channels_last", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "filters": 128, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "depthwise_constraint": null, "pointwise_regularizer": null, "depthwise_regularizer": null, "activation": "linear", "pointwise_constraint": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "block2_sepconv2", "inbound_nodes": [[["block2_sepconv2_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "block2_sepconv2_bn", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "scale": true, "axis": -1, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 0.001}, "name": "block2_sepconv2_bn", "inbound_nodes": [[["block2_sepconv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": false, "bias_regularizer": null, "name": "conv2d_1", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "filters": 128, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "padding": "same", "strides": [2, 2], "trainable": true, "dilation_rate": [1, 1], "kernel_size": [1, 1], "activation": "linear"}, "name": "conv2d_1", "inbound_nodes": [[["block1_conv2_act", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"padding": "same", "name": "block2_pool", "strides": [2, 2], "data_format": "channels_last", "trainable": true, "pool_size": [3, 3]}, "name": "block2_pool", "inbound_nodes": [[["block2_sepconv2_bn", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batch_normalization_1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "scale": true, "axis": -1, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 0.001}, "name": "batch_normalization_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_1"}, "name": "add_1", "inbound_nodes": [[["block2_pool", 0, 0, {}], ["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "block3_sepconv1_act", "activation": "relu"}, "name": "block3_sepconv1_act", "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"use_bias": false, "bias_regularizer": null, "name": "block3_sepconv1", "depth_multiplier": 1, "data_format": "channels_last", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "filters": 256, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "depthwise_constraint": null, "pointwise_regularizer": null, "depthwise_regularizer": null, "activation": "linear", "pointwise_constraint": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "block3_sepconv1", "inbound_nodes": [[["block3_sepconv1_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "block3_sepconv1_bn", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "scale": true, "axis": -1, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 0.001}, "name": "block3_sepconv1_bn", "inbound_nodes": [[["block3_sepconv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "block3_sepconv2_act", "activation": "relu"}, "name": "block3_sepconv2_act", "inbound_nodes": [[["block3_sepconv1_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"use_bias": false, "bias_regularizer": null, "name": "block3_sepconv2", "depth_multiplier": 1, "data_format": "channels_last", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "filters": 256, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "depthwise_constraint": null, "pointwise_regularizer": null, "depthwise_regularizer": null, "activation": "linear", "pointwise_constraint": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "block3_sepconv2", "inbound_nodes": [[["block3_sepconv2_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "block3_sepconv2_bn", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "scale": true, "axis": -1, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 0.001}, "name": "block3_sepconv2_bn", "inbound_nodes": [[["block3_sepconv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": false, "bias_regularizer": null, "name": "conv2d_2", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "filters": 256, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "padding": "same", "strides": [2, 2], "trainable": true, "dilation_rate": [1, 1], "kernel_size": [1, 1], "activation": "linear"}, "name": "conv2d_2", "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"padding": "same", "name": "block3_pool", "strides": [2, 2], "data_format": "channels_last", "trainable": true, "pool_size": [3, 3]}, "name": "block3_pool", "inbound_nodes": [[["block3_sepconv2_bn", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batch_normalization_2", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "scale": true, "axis": -1, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 0.001}, "name": "batch_normalization_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_2"}, "name": "add_2", "inbound_nodes": [[["block3_pool", 0, 0, {}], ["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "block4_sepconv1_act", "activation": "relu"}, "name": "block4_sepconv1_act", "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"use_bias": false, "bias_regularizer": null, "name": "block4_sepconv1", "depth_multiplier": 1, "data_format": "channels_last", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "filters": 728, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "depthwise_constraint": null, "pointwise_regularizer": null, "depthwise_regularizer": null, "activation": "linear", "pointwise_constraint": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "block4_sepconv1", "inbound_nodes": [[["block4_sepconv1_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "block4_sepconv1_bn", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "scale": true, "axis": -1, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 0.001}, "name": "block4_sepconv1_bn", "inbound_nodes": [[["block4_sepconv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "block4_sepconv2_act", "activation": "relu"}, "name": "block4_sepconv2_act", "inbound_nodes": [[["block4_sepconv1_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"use_bias": false, "bias_regularizer": null, "name": "block4_sepconv2", "depth_multiplier": 1, "data_format": "channels_last", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "filters": 728, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "depthwise_constraint": null, "pointwise_regularizer": null, "depthwise_regularizer": null, "activation": "linear", "pointwise_constraint": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "block4_sepconv2", "inbound_nodes": [[["block4_sepconv2_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "block4_sepconv2_bn", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "scale": true, "axis": -1, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 0.001}, "name": "block4_sepconv2_bn", "inbound_nodes": [[["block4_sepconv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": false, "bias_regularizer": null, "name": "conv2d_3", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "data_format": "channels_last", "filters": 728, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "padding": "same", "strides": [2, 2], "trainable": true, "dilation_rate": [1, 1], "kernel_size": [1, 1], "activation": "linear"}, "name": "conv2d_3", "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"padding": "same", "name": "block4_pool", "strides": [2, 2], "data_format": "channels_last", "trainable": true, "pool_size": [3, 3]}, "name": "block4_pool", "inbound_nodes": [[["block4_sepconv2_bn", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batch_normalization_3", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "scale": true, "axis": -1, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 0.001}, "name": "batch_normalization_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_3"}, "name": "add_3", "inbound_nodes": [[["block4_pool", 0, 0, {}], ["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "block5_sepconv1_act", "activation": "relu"}, "name": "block5_sepconv1_act", "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"use_bias": false, "bias_regularizer": null, "name": "block5_sepconv1", "depth_multiplier": 1, "data_format": "channels_last", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "filters": 728, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "depthwise_constraint": null, "pointwise_regularizer": null, "depthwise_regularizer": null, "activation": "linear", "pointwise_constraint": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "block5_sepconv1", "inbound_nodes": [[["block5_sepconv1_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "block5_sepconv1_bn", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "scale": true, "axis": -1, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 0.001}, "name": "block5_sepconv1_bn", "inbound_nodes": [[["block5_sepconv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "block5_sepconv2_act", "activation": "relu"}, "name": "block5_sepconv2_act", "inbound_nodes": [[["block5_sepconv1_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"use_bias": false, "bias_regularizer": null, "name": "block5_sepconv2", "depth_multiplier": 1, "data_format": "channels_last", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "filters": 728, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "depthwise_constraint": null, "pointwise_regularizer": null, "depthwise_regularizer": null, "activation": "linear", "pointwise_constraint": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "block5_sepconv2", "inbound_nodes": [[["block5_sepconv2_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "block5_sepconv2_bn", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "scale": true, "axis": -1, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 0.001}, "name": "block5_sepconv2_bn", "inbound_nodes": [[["block5_sepconv2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "block5_sepconv3_act", "activation": "relu"}, "name": "block5_sepconv3_act", "inbound_nodes": [[["block5_sepconv2_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"use_bias": false, "bias_regularizer": null, "name": "block5_sepconv3", "depth_multiplier": 1, "data_format": "channels_last", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "filters": 728, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "depthwise_constraint": null, "pointwise_regularizer": null, "depthwise_regularizer": null, "activation": "linear", "pointwise_constraint": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "block5_sepconv3", "inbound_nodes": [[["block5_sepconv3_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "block5_sepconv3_bn", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "scale": true, "axis": -1, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 0.001}, "name": "block5_sepconv3_bn", "inbound_nodes": [[["block5_sepconv3", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_4"}, "name": "add_4", "inbound_nodes": [[["block5_sepconv3_bn", 0, 0, {}], ["add_3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "block6_sepconv1_act", "activation": "relu"}, "name": "block6_sepconv1_act", "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"use_bias": false, "bias_regularizer": null, "name": "block6_sepconv1", "depth_multiplier": 1, "data_format": "channels_last", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "filters": 728, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "depthwise_constraint": null, "pointwise_regularizer": null, "depthwise_regularizer": null, "activation": "linear", "pointwise_constraint": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "block6_sepconv1", "inbound_nodes": [[["block6_sepconv1_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "block6_sepconv1_bn", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "scale": true, "axis": -1, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 0.001}, "name": "block6_sepconv1_bn", "inbound_nodes": [[["block6_sepconv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "block6_sepconv2_act", "activation": "relu"}, "name": "block6_sepconv2_act", "inbound_nodes": [[["block6_sepconv1_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"use_bias": false, "bias_regularizer": null, "name": "block6_sepconv2", "depth_multiplier": 1, "data_format": "channels_last", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "filters": 728, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "depthwise_constraint": null, "pointwise_regularizer": null, "depthwise_regularizer": null, "activation": "linear", "pointwise_constraint": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "block6_sepconv2", "inbound_nodes": [[["block6_sepconv2_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "block6_sepconv2_bn", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "scale": true, "axis": -1, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 0.001}, "name": "block6_sepconv2_bn", "inbound_nodes": [[["block6_sepconv2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "block6_sepconv3_act", "activation": "relu"}, "name": "block6_sepconv3_act", "inbound_nodes": [[["block6_sepconv2_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"use_bias": false, "bias_regularizer": null, "name": "block6_sepconv3", "depth_multiplier": 1, "data_format": "channels_last", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "filters": 728, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "depthwise_constraint": null, "pointwise_regularizer": null, "depthwise_regularizer": null, "activation": "linear", "pointwise_constraint": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "block6_sepconv3", "inbound_nodes": [[["block6_sepconv3_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "block6_sepconv3_bn", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "scale": true, "axis": -1, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 0.001}, "name": "block6_sepconv3_bn", "inbound_nodes": [[["block6_sepconv3", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_5"}, "name": "add_5", "inbound_nodes": [[["block6_sepconv3_bn", 0, 0, {}], ["add_4", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "block7_sepconv1_act", "activation": "relu"}, "name": "block7_sepconv1_act", "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"use_bias": false, "bias_regularizer": null, "name": "block7_sepconv1", "depth_multiplier": 1, "data_format": "channels_last", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "filters": 728, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "depthwise_constraint": null, "pointwise_regularizer": null, "depthwise_regularizer": null, "activation": "linear", "pointwise_constraint": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "block7_sepconv1", "inbound_nodes": [[["block7_sepconv1_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "block7_sepconv1_bn", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "scale": true, "axis": -1, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 0.001}, "name": "block7_sepconv1_bn", "inbound_nodes": [[["block7_sepconv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "block7_sepconv2_act", "activation": "relu"}, "name": "block7_sepconv2_act", "inbound_nodes": [[["block7_sepconv1_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"use_bias": false, "bias_regularizer": null, "name": "block7_sepconv2", "depth_multiplier": 1, "data_format": "channels_last", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "filters": 728, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "depthwise_constraint": null, "pointwise_regularizer": null, "depthwise_regularizer": null, "activation": "linear", "pointwise_constraint": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "block7_sepconv2", "inbound_nodes": [[["block7_sepconv2_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "block7_sepconv2_bn", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "scale": true, "axis": -1, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 0.001}, "name": "block7_sepconv2_bn", "inbound_nodes": [[["block7_sepconv2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "block7_sepconv3_act", "activation": "relu"}, "name": "block7_sepconv3_act", "inbound_nodes": [[["block7_sepconv2_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"use_bias": false, "bias_regularizer": null, "name": "block7_sepconv3", "depth_multiplier": 1, "data_format": "channels_last", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "filters": 728, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "depthwise_constraint": null, "pointwise_regularizer": null, "depthwise_regularizer": null, "activation": "linear", "pointwise_constraint": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "block7_sepconv3", "inbound_nodes": [[["block7_sepconv3_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "block7_sepconv3_bn", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "scale": true, "axis": -1, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 0.001}, "name": "block7_sepconv3_bn", "inbound_nodes": [[["block7_sepconv3", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_6"}, "name": "add_6", "inbound_nodes": [[["block7_sepconv3_bn", 0, 0, {}], ["add_5", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "block8_sepconv1_act", "activation": "relu"}, "name": "block8_sepconv1_act", "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"use_bias": false, "bias_regularizer": null, "name": "block8_sepconv1", "depth_multiplier": 1, "data_format": "channels_last", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "filters": 728, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "depthwise_constraint": null, "pointwise_regularizer": null, "depthwise_regularizer": null, "activation": "linear", "pointwise_constraint": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "block8_sepconv1", "inbound_nodes": [[["block8_sepconv1_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "block8_sepconv1_bn", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "scale": true, "axis": -1, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 0.001}, "name": "block8_sepconv1_bn", "inbound_nodes": [[["block8_sepconv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "block8_sepconv2_act", "activation": "relu"}, "name": "block8_sepconv2_act", "inbound_nodes": [[["block8_sepconv1_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"use_bias": false, "bias_regularizer": null, "name": "block8_sepconv2", "depth_multiplier": 1, "data_format": "channels_last", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "filters": 728, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "depthwise_constraint": null, "pointwise_regularizer": null, "depthwise_regularizer": null, "activation": "linear", "pointwise_constraint": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "block8_sepconv2", "inbound_nodes": [[["block8_sepconv2_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "block8_sepconv2_bn", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "scale": true, "axis": -1, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 0.001}, "name": "block8_sepconv2_bn", "inbound_nodes": [[["block8_sepconv2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "block8_sepconv3_act", "activation": "relu"}, "name": "block8_sepconv3_act", "inbound_nodes": [[["block8_sepconv2_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"use_bias": false, "bias_regularizer": null, "name": "block8_sepconv3", "depth_multiplier": 1, "data_format": "channels_last", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "filters": 728, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "depthwise_constraint": null, "pointwise_regularizer": null, "depthwise_regularizer": null, "activation": "linear", "pointwise_constraint": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "block8_sepconv3", "inbound_nodes": [[["block8_sepconv3_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "block8_sepconv3_bn", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "scale": true, "axis": -1, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 0.001}, "name": "block8_sepconv3_bn", "inbound_nodes": [[["block8_sepconv3", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_7"}, "name": "add_7", "inbound_nodes": [[["block8_sepconv3_bn", 0, 0, {}], ["add_6", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "block9_sepconv1_act", "activation": "relu"}, "name": "block9_sepconv1_act", "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"use_bias": false, "bias_regularizer": null, "name": "block9_sepconv1", "depth_multiplier": 1, "data_format": "channels_last", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "filters": 728, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "depthwise_constraint": null, "pointwise_regularizer": null, "depthwise_regularizer": null, "activation": "linear", "pointwise_constraint": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "block9_sepconv1", "inbound_nodes": [[["block9_sepconv1_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "block9_sepconv1_bn", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "scale": true, "axis": -1, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 0.001}, "name": "block9_sepconv1_bn", "inbound_nodes": [[["block9_sepconv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "block9_sepconv2_act", "activation": "relu"}, "name": "block9_sepconv2_act", "inbound_nodes": [[["block9_sepconv1_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"use_bias": false, "bias_regularizer": null, "name": "block9_sepconv2", "depth_multiplier": 1, "data_format": "channels_last", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "filters": 728, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "depthwise_constraint": null, "pointwise_regularizer": null, "depthwise_regularizer": null, "activation": "linear", "pointwise_constraint": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "block9_sepconv2", "inbound_nodes": [[["block9_sepconv2_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "block9_sepconv2_bn", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "scale": true, "axis": -1, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 0.001}, "name": "block9_sepconv2_bn", "inbound_nodes": [[["block9_sepconv2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "block9_sepconv3_act", "activation": "relu"}, "name": "block9_sepconv3_act", "inbound_nodes": [[["block9_sepconv2_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"use_bias": false, "bias_regularizer": null, "name": "block9_sepconv3", "depth_multiplier": 1, "data_format": "channels_last", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "filters": 728, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "depthwise_constraint": null, "pointwise_regularizer": null, "depthwise_regularizer": null, "activation": "linear", "pointwise_constraint": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "block9_sepconv3", "inbound_nodes": [[["block9_sepconv3_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "block9_sepconv3_bn", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "scale": true, "axis": -1, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 0.001}, "name": "block9_sepconv3_bn", "inbound_nodes": [[["block9_sepconv3", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_8"}, "name": "add_8", "inbound_nodes": [[["block9_sepconv3_bn", 0, 0, {}], ["add_7", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "block10_sepconv1_act", "activation": "relu"}, "name": "block10_sepconv1_act", "inbound_nodes": [[["add_8", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"use_bias": false, "bias_regularizer": null, "name": "block10_sepconv1", "depth_multiplier": 1, "data_format": "channels_last", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "filters": 728, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "depthwise_constraint": null, "pointwise_regularizer": null, "depthwise_regularizer": null, "activation": "linear", "pointwise_constraint": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "block10_sepconv1", "inbound_nodes": [[["block10_sepconv1_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "block10_sepconv1_bn", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "scale": true, "axis": -1, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 0.001}, "name": "block10_sepconv1_bn", "inbound_nodes": [[["block10_sepconv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "block10_sepconv2_act", "activation": "relu"}, "name": "block10_sepconv2_act", "inbound_nodes": [[["block10_sepconv1_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"use_bias": false, "bias_regularizer": null, "name": "block10_sepconv2", "depth_multiplier": 1, "data_format": "channels_last", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "filters": 728, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "depthwise_constraint": null, "pointwise_regularizer": null, "depthwise_regularizer": null, "activation": "linear", "pointwise_constraint": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "dilation_rate": [1, 1], "strides": [1, 1]}, "name": "block10_sepconv2", "inbound_nodes": [[["block10_sepconv2_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "block10_sepconv2_bn", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "scale": true, "axis": -1, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "epsilon": 0.001}, "name": "block10_sepconv2_bn", "inbound_nodes": [[["block10_sepconv2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "block10_sepconv3_act", "activation": "relu"}, "name": "block10_sepconv3_act", "inbound_nodes": [[["block10_sepconv2_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"use_bias": false, "bias_regularizer": null, "name": "block10_sepconv3", "depth_multiplier": 1, "data_format": "channels_last", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "filters": 728, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "depthwise_constraint": null, "pointwise_regularizer": null, "depthwise_regularizer": null, "activation": "linear", 