{"keras_version": "2.1.6", "backend": "tensorflow", "class_name": "Model", "config": {"output_layers": [["dense_1", 0, 0]], "input_layers": [["input_1", 0, 0]], "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_1", "config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, 299, 299, 3], "name": "input_1"}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_1", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "trainable": false, "activation": "linear", "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "filters": 32, "use_bias": false, "bias_constraint": null, "name": "conv2d_1", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_1", "config": {"epsilon": 0.001, "trainable": false, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_regularizer": null, "beta_constraint": null, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "name": "batch_normalization_1"}}, {"inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "class_name": "Activation", "name": "activation_1", "config": {"trainable": false, "activation": "relu", "name": "activation_1"}}, {"inbound_nodes": [[["activation_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_2", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "trainable": false, "activation": "linear", "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "filters": 32, "use_bias": false, "bias_constraint": null, "name": "conv2d_2", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_2", "config": {"epsilon": 0.001, "trainable": false, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_regularizer": null, "beta_constraint": null, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "name": "batch_normalization_2"}}, {"inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "class_name": "Activation", "name": "activation_2", "config": {"trainable": false, "activation": "relu", "name": "activation_2"}}, {"inbound_nodes": [[["activation_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_3", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "trainable": false, "activation": "linear", "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "filters": 64, "use_bias": false, "bias_constraint": null, "name": "conv2d_3", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_3", "config": {"epsilon": 0.001, "trainable": false, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_regularizer": null, "beta_constraint": null, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "name": "batch_normalization_3"}}, {"inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "class_name": "Activation", "name": "activation_3", "config": {"trainable": false, "activation": "relu", "name": "activation_3"}}, {"inbound_nodes": [[["activation_3", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_1", "config": {"strides": [2, 2], "padding": "valid", "pool_size": [3, 3], "trainable": false, "data_format": "channels_last", "name": "max_pooling2d_1"}}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_4", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "trainable": false, "activation": "linear", "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "filters": 80, "use_bias": false, "bias_constraint": null, "name": "conv2d_4", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_4", "config": {"epsilon": 0.001, "trainable": false, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_regularizer": null, "beta_constraint": null, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "name": "batch_normalization_4"}}, {"inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "class_name": "Activation", "name": "activation_4", "config": {"trainable": false, "activation": "relu", "name": "activation_4"}}, {"inbound_nodes": [[["activation_4", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_5", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "trainable": false, "activation": "linear", "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "filters": 192, "use_bias": false, "bias_constraint": null, "name": "conv2d_5", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_5", "config": {"epsilon": 0.001, "trainable": false, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_regularizer": null, "beta_constraint": null, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "name": "batch_normalization_5"}}, {"inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "class_name": "Activation", "name": "activation_5", "config": {"trainable": false, "activation": "relu", "name": "activation_5"}}, {"inbound_nodes": [[["activation_5", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_2", "config": {"strides": [2, 2], "padding": "valid", "pool_size": [3, 3], "trainable": false, "data_format": "channels_last", "name": "max_pooling2d_2"}}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_9", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "trainable": false, "activation": "linear", "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "filters": 64, "use_bias": false, "bias_constraint": null, "name": "conv2d_9", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_9", "config": {"epsilon": 0.001, "trainable": false, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_regularizer": null, "beta_constraint": null, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "name": "batch_normalization_9"}}, {"inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "class_name": "Activation", "name": "activation_9", "config": {"trainable": false, "activation": "relu", "name": "activation_9"}}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_7", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "trainable": false, "activation": "linear", "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "filters": 48, "use_bias": false, "bias_constraint": null, "name": "conv2d_7", "bias_regularizer": null}}, {"inbound_nodes": [[["activation_9", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_10", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "trainable": false, "activation": "linear", "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "filters": 96, "use_bias": false, "bias_constraint": null, "name": "conv2d_10", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_7", "config": {"epsilon": 0.001, "trainable": false, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_regularizer": null, "beta_constraint": null, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "name": "batch_normalization_7"}}, {"inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_10", "config": {"epsilon": 0.001, "trainable": false, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_regularizer": null, "beta_constraint": null, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "name": "batch_normalization_10"}}, {"inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "class_name": "Activation", "name": "activation_7", "config": {"trainable": false, "activation": "relu", "name": "activation_7"}}, {"inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "class_name": "Activation", "name": "activation_10", "config": {"trainable": false, "activation": "relu", "name": "activation_10"}}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "AveragePooling2D", "name": "average_pooling2d_1", "config": {"strides": [1, 1], "padding": "same", "pool_size": [3, 3], "trainable": false, "data_format": "channels_last", "name": "average_pooling2d_1"}}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_6", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "trainable": false, "activation": "linear", "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "filters": 96, "use_bias": false, "bias_constraint": null, "name": "conv2d_6", "bias_regularizer": null}}, {"inbound_nodes": [[["activation_7", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_8", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "trainable": false, "activation": "linear", "kernel_constraint": null, "kernel_size": [5, 5], "data_format": "channels_last", "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "filters": 64, "use_bias": false, "bias_constraint": null, "name": "conv2d_8", "bias_regularizer": null}}, {"inbound_nodes": [[["activation_10", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_11", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "trainable": false, "activation": "linear", "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "filters": 96, "use_bias": false, "bias_constraint": null, "name": "conv2d_11", "bias_regularizer": null}}, {"inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_12", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "trainable": false, "activation": "linear", "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "filters": 64, "use_bias": false, "bias_constraint": null, "name": "conv2d_12", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_6", "config": {"epsilon": 0.001, "trainable": false, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_regularizer": null, "beta_constraint": null, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "name": "batch_normalization_6"}}, {"inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_8", "config": {"epsilon": 0.001, "trainable": false, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_regularizer": null, "beta_constraint": null, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "name": "batch_normalization_8"}}, {"inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_11", "config": {"epsilon": 0.001, "trainable": false, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_regularizer": null, "beta_constraint": null, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "name": "batch_normalization_11"}}, {"inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_12", "config": {"epsilon": 0.001, "trainable": false, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_regularizer": null, "beta_constraint": null, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "name": "batch_normalization_12"}}, {"inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "class_name": "Activation", "name": "activation_6", "config": {"trainable": false, "activation": "relu", "name": "activation_6"}}, {"inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "class_name": "Activation", "name": "activation_8", "config": {"trainable": false, "activation": "relu", "name": "activation_8"}}, {"inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "class_name": "Activation", "name": "activation_11", "config": {"trainable": false, "activation": "relu", "name": "activation_11"}}, {"inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "class_name": "Activation", "name": "activation_12", "config": {"trainable": false, "activation": "relu", "name": "activation_12"}}, {"inbound_nodes": [[["activation_6", 0, 0, {}], ["activation_8", 0, 0, {}], ["activation_11", 0, 0, {}], ["activation_12", 0, 0, {}]]], "class_name": "Concatenate", "name": "mixed_5b", "config": {"axis": 3, "trainable": false, "name": "mixed_5b"}}, {"inbound_nodes": [[["mixed_5b", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_16", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "trainable": false, "activation": "linear", "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "filters": 32, "use_bias": false, "bias_constraint": null, "name": "conv2d_16", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_16", "config": {"epsilon": 0.001, "trainable": false, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_regularizer": null, "beta_constraint": null, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "name": "batch_normalization_16"}}, {"inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "class_name": "Activation", "name": "activation_16", "config": {"trainable": false, "activation": "relu", "name": "activation_16"}}, {"inbound_nodes": [[["mixed_5b", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_14", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "trainable": false, "activation": "linear", "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "filters": 32, "use_bias": false, "bias_constraint": null, "name": "conv2d_14", "bias_regularizer": null}}, {"inbound_nodes": [[["activation_16", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_17", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "trainable": false, "activation": "linear", "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "filters": 48, "use_bias": false, "bias_constraint": null, "name": "conv2d_17", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_14", "config": {"epsilon": 0.001, "trainable": false, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_regularizer": null, "beta_constraint": null, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "name": "batch_normalization_14"}}, {"inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_17", "config": {"epsilon": 0.001, "trainable": false, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_regularizer": null, "beta_constraint": null, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "name": "batch_normalization_17"}}, {"inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "class_name": "Activation", "name": "activation_14", "config": {"trainable": false, "activation": "relu", "name": "activation_14"}}, {"inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]], "class_name": "Activation", "name": "activation_17", "config": {"trainable": false, "activation": "relu", "name": "activation_17"}}, {"inbound_nodes": [[["mixed_5b", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_13", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "trainable": false, "activation": "linear", "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "filters": 32, "use_bias": false, "bias_constraint": null, "name": "conv2d_13", "bias_regularizer": null}}, {"inbound_nodes": [[["activation_14", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_15", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "trainable": false, "activation": "linear", "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "filters": 32, "use_bias": false, "bias_constraint": null, "name": "conv2d_15", "bias_regularizer": null}}, {"inbound_nodes": [[["activation_17", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_18", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "trainable": false, "activation": "linear", "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "filters": 64, "use_bias": false, "bias_constraint": null, "name": "conv2d_18", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_13", "config": {"epsilon": 0.001, "trainable": false, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_regularizer": null, "beta_constraint": null, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "name": "batch_normalization_13"}}, {"inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_15", "config": {"epsilon": 0.001, "trainable": false, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_regularizer": null, "beta_constraint": null, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "name": "batch_normalization_15"}}, {"inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_18", "config": {"epsilon": 0.001, "trainable": false, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_regularizer": null, "beta_constraint": null, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "name": "batch_normalization_18"}}, {"inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "class_name": "Activation", "name": "activation_13", "config": {"trainable": false, "activation": "relu", "name": "activation_13"}}, {"inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]], "class_name": "Activation", "name": "activation_15", "config": {"trainable": false, "activation": "relu", "name": "activation_15"}}, {"inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]], "class_name": "Activation", "name": "activation_18", "config": {"trainable": false, "activation": "relu", "name": "activation_18"}}, {"inbound_nodes": [[["activation_13", 0, 0, {}], ["activation_15", 0, 0, {}], ["activation_18", 0, 0, {}]]], "class_name": "Concatenate", "name": "block35_1_mixed", "config": {"axis": 3, "trainable": false, "name": "block35_1_mixed"}}, {"inbound_nodes": [[["block35_1_mixed", 0, 0, {}]]], "class_name": "Conv2D", "name": "block35_1_conv", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "trainable": false, "activation": "linear", "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "filters": 320, "use_bias": true, "bias_constraint": null, "name": "block35_1_conv", "bias_regularizer": null}}, {"inbound_nodes": [[["mixed_5b", 0, 0, {}], ["block35_1_conv", 0, 0, {}]]], "class_name": "Lambda", "name": "block35_1", "config": {"output_shape_type": "raw", "trainable": false, "arguments": {"scale": 0.17}, "function_type": "lambda", "function": ["4wIAAAAAAAAAAgAAAAMAAABTAAAAcxQAAAB8AABkAQAZfAAAZAIAGXwBABQXUykDTukAAAAA6QEA\nAACpACkC2gZpbnB1dHPaBXNjYWxlcgMAAAByAwAAAPpvQzpcVXNlcnNcSm9lXEFwcERhdGFcTG9j\nYWxcUHJvZ3JhbXNcUHl0aG9uXFB5dGhvbjM1XGxpYlxzaXRlLXBhY2thZ2VzXGtlcmFzXGFwcGxp\nY2F0aW9uc1xpbmNlcHRpb25fcmVzbmV0X3YyLnB52gg8bGFtYmRhPqgAAADzAAAAAA==\n", null, null], "name": "block35_1", "output_shape": [35, 35, 320]}}, {"inbound_nodes": [[["block35_1", 0, 0, {}]]], "class_name": "Activation", "name": "block35_1_ac", "config": {"trainable": false, "activation": "relu", "name": "block35_1_ac"}}, {"inbound_nodes": [[["block35_1_ac", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_22", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "trainable": false, "activation": "linear", "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "filters": 32, "use_bias": false, "bias_constraint": null, "name": "conv2d_22", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_22", "config": {"epsilon": 0.001, "trainable": false, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_regularizer": null, "beta_constraint": null, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "name": "batch_normalization_22"}}, {"inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]], "class_name": "Activation", "name": "activation_22", "config": {"trainable": false, "activation": "relu", "name": "activation_22"}}, {"inbound_nodes": [[["block35_1_ac", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_20", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "trainable": false, "activation": "linear", "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "filters": 32, "use_bias": false, "bias_constraint": null, "name": "conv2d_20", "bias_regularizer": null}}, {"inbound_nodes": [[["activation_22", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_23", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "trainable": false, "activation": "linear", "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "filters": 48, "use_bias": false, "bias_constraint": null, "name": "conv2d_23", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_20", "config": {"epsilon": 0.001, "trainable": false, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_regularizer": null, "beta_constraint": null, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "name": "batch_normalization_20"}}, {"inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_23", "config": {"epsilon": 0.001, "trainable": false, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_regularizer": null, "beta_constraint": null, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "name": "batch_normalization_23"}}, {"inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]], "class_name": "Activation", "name": "activation_20", "config": {"trainable": false, "activation": "relu", "name": "activation_20"}}, {"inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]], "class_name": "Activation", "name": "activation_23", "config": {"trainable": false, "activation": "relu", "name": "activation_23"}}, {"inbound_nodes": [[["block35_1_ac", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_19", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "trainable": false, "activation": "linear", "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "filters": 32, "use_bias": false, "bias_constraint": null, "name": "conv2d_19", "bias_regularizer": null}}, {"inbound_nodes": [[["activation_20", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_21", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "trainable": false, "activation": "linear", "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "filters": 32, "use_bias": false, "bias_constraint": null, "name": "conv2d_21", "bias_regularizer": null}}, {"inbound_nodes": [[["activation_23", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_24", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "trainable": false, "activation": "linear", "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "filters": 64, "use_bias": false, "bias_constraint": null, "name": "conv2d_24", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_19", "config": {"epsilon": 0.001, "trainable": false, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_regularizer": null, "beta_constraint": null, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "name": "batch_normalization_19"}}, {"inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_21", "config": {"epsilon": 0.001, "trainable": false, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_regularizer": null, "beta_constraint": null, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "name": "batch_normalization_21"}}, {"inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_24", "config": {"epsilon": 0.001, "trainable": false, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_regularizer": null, "beta_constraint": null, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "name": "batch_normalization_24"}}, {"inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]], "class_name": "Activation", "name": "activation_19", "config": {"trainable": false, "activation": "relu", "name": "activation_19"}}, {"inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]], "class_name": "Activation", "name": "activation_21", "config": {"trainable": false, "activation": "relu", "name": "activation_21"}}, {"inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]], "class_name": "Activation", "name": "activation_24", "config": {"trainable": false, "activation": "relu", "name": "activation_24"}}, {"inbound_nodes": [[["activation_19", 0, 0, {}], ["activation_21", 0, 0, {}], ["activation_24", 0, 0, {}]]], "class_name": "Concatenate", "name": "block35_2_mixed", "config": {"axis": 3, "trainable": false, "name": "block35_2_mixed"}}, {"inbound_nodes": [[["block35_2_mixed", 0, 0, {}]]], "class_name": "Conv2D", "name": "block35_2_conv", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "trainable": false, "activation": "linear", "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "filters": 320, "use_bias": true, "bias_constraint": null, "name": "block35_2_conv", "bias_regularizer": null}}, {"inbound_nodes": [[["block35_1_ac", 0, 0, {}], ["block35_2_conv", 0, 0, {}]]], "class_name": "Lambda", "name": "block35_2", "config": {"output_shape_type": "raw", "trainable": false, "arguments": {"scale": 0.17}, "function_type": "lambda", "function": ["4wIAAAAAAAAAAgAAAAMAAABTAAAAcxQAAAB8AABkAQAZfAAAZAIAGXwBABQXUykDTukAAAAA6QEA\nAACpACkC2gZpbnB1dHPaBXNjYWxlcgMAAAByAwAAAPpvQzpcVXNlcnNcSm9lXEFwcERhdGFcTG9j\nYWxcUHJvZ3JhbXNcUHl0aG9uXFB5dGhvbjM1XGxpYlxzaXRlLXBhY2thZ2VzXGtlcmFzXGFwcGxp\nY2F0aW9uc1xpbmNlcHRpb25fcmVzbmV0X3YyLnB52gg8bGFtYmRhPqgAAADzAAAAAA==\n", null, null], "name": "block35_2", "output_shape": [35, 35, 320]}}, {"inbound_nodes": [[["block35_2", 0, 0, {}]]], "class_name": "Activation", "name": "block35_2_ac", "config": {"trainable": false, "activation": "relu", "name": "block35_2_ac"}}, {"inbound_nodes": [[["block35_2_ac", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_28", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "trainable": false, "activation": "linear", "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "filters": 32, "use_bias": false, "bias_constraint": null, "name": "conv2d_28", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_28", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_28", "config": {"epsilon": 0.001, "trainable": false, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_regularizer": null, "beta_constraint": null, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "name": "batch_normalization_28"}}, {"inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]], "class_name": "Activation", "name": "activation_28", "config": {"trainable": false, "activation": "relu", "name": "activation_28"}}, {"inbound_nodes": [[["block35_2_ac", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_26", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "trainable": false, "activation": "linear", "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "filters": 32, "use_bias": false, "bias_constraint": null, "name": "conv2d_26", "bias_regularizer": null}}, {"inbound_nodes": [[["activation_28", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_29", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "trainable": false, "activation": "linear", "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "filters": 48, "use_bias": false, "bias_constraint": null, "name": "conv2d_29", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_26", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_26", "config": {"epsilon": 0.001, "trainable": false, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_regularizer": null, "beta_constraint": null, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "name": "batch_normalization_26"}}, {"inbound_nodes": [[["conv2d_29", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_29", "config": {"epsilon": 0.001, "trainable": false, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_regularizer": null, "beta_constraint": null, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "name": "batch_normalization_29"}}, {"inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]], "class_name": "Activation", "name": "activation_26", "config": {"trainable": false, "activation": "relu", "name": "activation_26"}}, {"inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]], "class_name": "Activation", "name": "activation_29", "config": {"trainable": false, "activation": "relu", "name": "activation_29"}}, {"inbound_nodes": [[["block35_2_ac", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_25", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "trainable": false, "activation": "linear", "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "filters": 32, "use_bias": false, "bias_constraint": null, "name": "conv2d_25", "bias_regularizer": null}}, {"inbound_nodes": [[["activation_26", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_27", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "trainable": false, "activation": "linear", "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "filters": 32, "use_bias": false, "bias_constraint": null, "name": "conv2d_27", "bias_regularizer": null}}, {"inbound_nodes": [[["activation_29", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_30", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "trainable": false, "activation": "linear", "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "filters": 64, "use_bias": false, "bias_constraint": null, "name": "conv2d_30", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_25", "config": {"epsilon": 0.001, "trainable": false, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_regularizer": null, "beta_constraint": null, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "name": "batch_normalization_25"}}, {"inbound_nodes": [[["conv2d_27", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_27", "config": {"epsilon": 0.001, "trainable": false, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_regularizer": null, "beta_constraint": null, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "name": "batch_normalization_27"}}, {"inbound_nodes": [[["conv2d_30", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_30", "config": {"epsilon": 0.001, "trainable": false, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "beta_regularizer": null, "beta_constraint": null, "axis": 3, "momentum": 0.99, "gamma_constraint": null, "name": "batch_normalization_30"}}, {"inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]], "class_name": "Activation", "name": "activation_25", "config": {"trainable": false, "activation": "relu", "name": "activation_25"}}, {"inbound_nodes": [[["batch_normalization_27", 0, 0, {}]]], "class_name": "Activation", "name": "activation_27", "config": {"trainable": false, "activation": "relu", "name": "activation_27"}}, {"inbound_nodes": [[["batch_normalization_30", 0, 0, {}]]], "class_name": "Activation", "name": "activation_30", "config": {"trainable": false, "activation": "relu", "name": "activation_30"}}, {"inbound_nodes": [[["activation_25", 0, 0, {}], ["activation_27", 0, 0, {}], ["activation_30", 0, 0, {}]]], "class_name": "Concatenate", "name": "block35_3_mixed", "config": {"axis": 3, "trainable": false, "name": "block35_3_mixed"}}, {"inbound_nodes": [[["block35_3_mixed", 0, 0, {}]]], "class_name": "Conv2D", "name": "block35_3_conv", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "trainable": false, "activation": "linear", "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "strides": [1, 1], "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "filters": 320, "use_bias": true, "bias_constraint": null, "name": "block35_3_conv", "bias_regularizer": null}}, {"inbound_nodes": [[["block35_2_ac", 